{"id":293,"date":"2020-04-19T18:12:35","date_gmt":"2020-04-19T18:12:35","guid":{"rendered":"https:\/\/www.milkybd.com\/?p=293"},"modified":"2020-04-19T18:12:35","modified_gmt":"2020-04-19T18:12:35","slug":"10-surprising-health-benefits-of-honey","status":"publish","type":"post","link":"https:\/\/milkybd.com\/10-surprising-health-benefits-of-honey\/","title":{"rendered":"10 Surprising Health Benefits of Honey"},"content":{"rendered":"\n<div class=\"wp-block-image\"><figure class=\"alignright size-large is-resized\"><img loading=\"lazy\" src=\"https:\/\/milkybd.com\/wp-content\/uploads\/2020\/04\/321873_2200-800x1200-1-683x1024.jpg\" alt=\"\" class=\"wp-image-295\" width=\"353\" height=\"528\" srcset=\"https:\/\/milkybd.com\/wp-content\/uploads\/2020\/04\/321873_2200-800x1200-1-683x1024.jpg 683w, https:\/\/milkybd.com\/wp-content\/uploads\/2020\/04\/321873_2200-800x1200-1-200x300.jpg 200w\" sizes=\"(max-width: 353px) 100vw, 353px\" \/><\/figure><\/div>\n\n\n\n<p><em><strong>Since ancient times, honey has been used as both a food and a medicine.<\/strong><\/em><\/p>\n\n\n\n<p>It&#8217;s very high in beneficial plant compounds and offers several health benefits. Honey is particularly healthy when used instead of refined sugar, which is 100% empty calories.<\/p>\n\n\n\n<p>Here are the top 10 health benefits of honey.<\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>1. Honey Contains Some Nutrients<\/strong><\/p>\n\n\n\n<p>Honey is a sweet, thick liquid made by honeybees.<\/p>\n\n\n\n<p>The bees collect sugar — mainly the sugar-rich nectar of flowers — from their environment.<\/p>\n\n\n\n<p>Once inside the beehive, they repeatedly consume, digest and regurgitate the nectar.<\/p>\n\n\n\n<p>The end product is honey, a liquid that serves as stored food for bees. The smell, color and taste depend on the types of flowers visited.<\/p>\n\n\n\n<p>Nutritionally, 1 tablespoon of honey (21 grams) contains 64 calories and 17 grams of sugar, including fructose, glucose, maltose and sucrose.<\/p>\n\n\n\n<p>It contains virtually no fiber, fat or protein.<\/p>\n\n\n\n<p>It also contains trace amounts — under 1% of the RDI — of several vitamins and minerals, but you would have to eat many pounds to fulfill your daily requirements.<\/p>\n\n\n\n<p>Where honey shines is in its content of bioactive plant compounds and antioxidants. Darker types tend to be even higher in these compounds than lighter types.<\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>2. High-Quality Honey Is Rich in Antioxidants<\/strong><\/p>\n\n\n\n<p>High-quality honey contains many important antioxidants. These include organic acids and phenolic compounds like flavonoids.<\/p>\n\n\n\n<p>Scientists believe that the combination of these compounds gives honey its antioxidant power.<\/p>\n\n\n\n<p>Interestingly, two studies have shown that buckwheat honey increases the antioxidant value of your blood.<\/p>\n\n\n\n<p>Antioxidants have been linked to reduced risk of heart attacks, strokes and some types of cancer. They may also promote eye health.<\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>3. Honey Is &#8220;Less Bad&#8221; Than Sugar for Diabetics<\/strong><\/p>\n\n\n\n<p>The evidence on honey and diabetes is mixed.<\/p>\n\n\n\n<p>On one hand, it can reduce several risk factors for heart disease common in people with type 2 diabetes.<\/p>\n\n\n\n<p>For example, it may lower “bad” LDL cholesterol, triglycerides and inflammation while raising “good” HDL cholesterol.<\/p>\n\n\n\n<p>However, some studies have found that it can also increase blood sugar levels — just not as much as refined sugar.<\/p>\n\n\n\n<p>While honey may be slightly better than refined sugar for people with diabetes, it should still be consumed with caution.<\/p>\n\n\n\n<p>In fact, people with diabetes may do best by minimizing all high-carb foods.<\/p>\n\n\n\n<p>Keep in mind, too, that certain types of honey may be adulterated with plain syrup. Although honey adulteration is illegal in most countries, it remains a widespread problem.<\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>4. The Antioxidants in It Can Help Lower Blood Pressure<\/strong><\/p>\n\n\n\n<p>Blood pressure is an important risk factor for heart disease, and honey may help lower it.<\/p>\n\n\n\n<p>This is because it contains antioxidant compounds that have been linked to lower blood pressure.<\/p>\n\n\n\n<p>Studies in both rats and humans have shown modest reductions in blood pressure from consuming honey.<\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>5. Honey Also Helps Improve Cholesterol<\/strong><\/p>\n\n\n\n<p>High LDL cholesterol levels is a strong risk factor for heart disease.<\/p>\n\n\n\n<p>This type of cholesterol plays a major role in atherosclerosis, the fatty buildup in your arteries that can lead to heart attacks and strokes.<\/p>\n\n\n\n<p>Interestingly, several studies show that honey may improve your cholesterol levels.<\/p>\n\n\n\n<p>It reduces total and “bad” LDL cholesterol while significantly raising “good” HDL cholesterol.<\/p>\n\n\n\n<p>For example, one study in 55 patients compared honey to table sugar and found that honey caused a 5.8% reduction in LDL and a 3.3% increase in HDL cholesterol. It also led to modest weight loss of 1.3%.<\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>6. Honey Can Lower Triglycerides<\/strong><\/p>\n\n\n\n<p>Elevated blood triglycerides are another risk factor for heart disease.<\/p>\n\n\n\n<p>They are also associated with insulin resistance, a major driver of type 2 diabetes.<\/p>\n\n\n\n<p>Triglyceride levels tend to increase on a diet high in sugar and refined carbs.<\/p>\n\n\n\n<p>Interestingly, multiple studies have linked regular honey consumption with lower triglyceride levels, especially when it is used to replace sugar.<\/p>\n\n\n\n<p>For example, one study comparing honey and sugar found 11–19% lower triglyceride levels in the honey group.<\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>7. The Antioxidants in It Are Linked to Other Beneficial Effects on Heart Health<\/strong><\/p>\n\n\n\n<p>Again, honey is a rich source of phenols and other antioxidant compounds. Many of these have been linked to a reduced risk of heart disease.<\/p>\n\n\n\n<p>They may help the arteries in your heart dilate, increasing blood flow to your heart. They may also help prevent blood clot formation, which can lead to heart attacks and strokes.<\/p>\n\n\n\n<p>Furthermore, one study in rats showed that honey protected the heart from oxidative stress.<\/p>\n\n\n\n<p>All told, there is no long-term human study available on honey and heart health. Take these results with a grain of salt.<\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>8. Honey Promotes Burn and Wound Healing<\/strong><\/p>\n\n\n\n<p>Topical honey treatment has been used to heal wounds and burns since ancient Egypt and is still common today.<\/p>\n\n\n\n<p>A review of 26 studies on honey and wound care found honey most effective at healing partial-thickness burns and wounds that have become infected after surgery.<\/p>\n\n\n\n<p>Honey is also an effective treatment for diabetic foot ulcers, which are serious complications that can lead to amputation.<\/p>\n\n\n\n<p>One study reported a 43.3% success rate with honey as a wound treatment. In another study, topical honey healed a whopping 97% of patients’ diabetic ulcers.<\/p>\n\n\n\n<p>Researchers believe that honey’s healing powers come from its antibacterial and anti-inflammatory effects as well as its ability to nourish surrounding tissue.<\/p>\n\n\n\n<p>What&#8217;s more, it can help treat other skin conditions, including psoriasis and herpes lesions.<\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>9. Honey Can Help Suppress Coughs in Children<\/strong><\/p>\n\n\n\n<p>Coughing is a common problem for children with upper respiratory infections.<\/p>\n\n\n\n<p>These infections can affect sleep and quality of life for both children and parents.<\/p>\n\n\n\n<p>However, mainstream medications for cough are not always effective and can have side effects. Interestingly, honey may be a better choice, and evidence indicates it is very effective.<\/p>\n\n\n\n<p>One study found that honey worked better than two common cough medications.<\/p>\n\n\n\n<p>Another study found that it reduced cough symptoms and improved sleep more than cough medication.<\/p>\n\n\n\n<p>Nevertheless, honey should never be given to children under one year of age due to the risk for botulism.<\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>10. It&#8217;s Delicious, But Still High in Calories and Sugar<\/strong><\/p>\n\n\n\n<p>Honey is a delicious, healthier alternative to sugar.<\/p>\n\n\n\n<p>Make sure to choose a high-quality brand, because some lower-quality ones may be mixed with syrup.<\/p>\n\n\n\n<p>Keep in mind that honey should only be consumed in moderation, as it is still high in calories and sugar.<\/p>\n\n\n\n<p>The benefits of honey are most pronounced when it is replacing another, unhealthier sweetener.<\/p>\n\n\n\n<p>At the end of the day, honey is simply a &#8220;less bad&#8221; sweetener than sugar and high-fructose corn syrup.<\/p>\n\n\n\n<p>Sources and References:<\/p>\n\n\n\n<p><a href=\"https:\/\/www.healthline.com\/nutrition\/10-benefits-of-honey#section9\">https:\/\/www.healthline.com\/nutrition\/10-benefits-of-honey#section9<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Since ancient times, honey has been used as both a food and a medicine. It&#8217;s very high in beneficial plant compounds and offers several health benefits. Honey is particularly healthy when used instead of refined sugar, which is 100% empty calories. Here are the top 10 health benefits of honey. 1. Honey Contains Some Nutrients [&#8230;]\n","protected":false},"author":1,"featured_media":294,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[17],"tags":[],"jetpack_featured_media_url":"https:\/\/milkybd.com\/wp-content\/uploads\/2020\/04\/2518c4_b9503948eac244ffb5ed83a9fa99d68c_mv2.jpeg","_links":{"self":[{"href":"https:\/\/milkybd.com\/wp-json\/wp\/v2\/posts\/293"}],"collection":[{"href":"https:\/\/milkybd.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/milkybd.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/milkybd.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/milkybd.com\/wp-json\/wp\/v2\/comments?post=293"}],"version-history":[{"count":2,"href":"https:\/\/milkybd.com\/wp-json\/wp\/v2\/posts\/293\/revisions"}],"predecessor-version":[{"id":297,"href":"https:\/\/milkybd.com\/wp-json\/wp\/v2\/posts\/293\/revisions\/297"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/milkybd.com\/wp-json\/wp\/v2\/media\/294"}],"wp:attachment":[{"href":"https:\/\/milkybd.com\/wp-json\/wp\/v2\/media?parent=293"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/milkybd.com\/wp-json\/wp\/v2\/categories?post=293"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/milkybd.com\/wp-json\/wp\/v2\/tags?post=293"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}